{
    "modelTopology": {
      "class_name": "Sequential",
      "config": [
        {
          "class_name": "Flatten",
          "config": {
            "batch_input_shape": [null, 28, 28],
            "dtype": "float32",
            "name": "flatten",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "batch_input_shape": [null, 784],
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense",
            "trainable": true,
            "units": 128,
            "use_bias": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 10,
            "use_bias": true
          }
        }
      ],
      "keras_version": "2.2.4-tf",
      "backend": "tensorflow"
    },
    "weightsManifest": [
      {
        "paths": ["group1-shard1of1.bin"],
        "weights": [
          {
            "name": "dense/kernel",
            "shape": [784, 128],
            "dtype": "float32"
          },
          {
            "name": "dense/bias",
            "shape": [128],
            "dtype": "float32"
          },
          {
            "name": "dense_1/kernel",
            "shape": [128, 10],
            "dtype": "float32"
          },
          {
            "name": "dense_1/bias",
            "shape": [10],
            "dtype": "float32"
          }
        ]
      }
    ]
  }
  